Revit 2027 API
BaseExportOptions.Colors Property
 Export color mode. Default value is ExportColorMode.IndexColors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportColorMode Colors { get; set; }
Public Property Colors As ExportColorMode
	Get
	Set
public:
property ExportColorMode Colors {
	ExportColorMode get ();
	void set (ExportColorMode value);
}
member Colors : ExportColorMode with get, set
Property Value
ExportColorMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace